app/controllers/seeker/applications_controller.rb

SELECT "job_applications".* FROM "job_applications" WHERE "job_applications"."user_id" = ? ORDER BY "job_applications"."created_at" DESC  [["user_id", 886196631]]
---
    def index
      @applications = current_user.job_applications.includes(job: %i[category user]).recent