app/controllers/seeker/dashboard_controller.rb

SELECT COUNT(*) FROM "job_applications" WHERE "job_applications"."user_id" = ?  [["user_id", 886196631]]
SELECT COUNT(*) FROM "saved_jobs" WHERE "saved_jobs"."user_id" = ?  [["user_id", 886196631]]
SELECT "job_applications".* FROM "job_applications" WHERE "job_applications"."user_id" = ? ORDER BY "job_applications"."created_at" DESC LIMIT ?  [["user_id", 886196631], ["LIMIT", 5]]
SELECT "saved_jobs".* FROM "saved_jobs" WHERE "saved_jobs"."user_id" = ? ORDER BY "saved_jobs"."created_at" DESC LIMIT ?  [["user_id", 886196631], ["LIMIT", 5]]
SELECT 1 AS one FROM "job_applications" WHERE "job_applications"."user_id" = ? LIMIT ?  [["user_id", 886196631], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 177190732], ["id", 556383200]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ?  [["id", 242652078]]
SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 886196631]]
---
    def show
      @applications_count = current_user.job_applications.count
      @interviews_count = current_user.job_applications.interview.count
      @offers_count = current_user.job_applications.offer.count
      @saved_count = current_user.saved_jobs.count

      @recent_applications = current_user.job_applications.includes(job: %i[category user]).recent.limit(5)
      @saved_jobs = current_user.saved_jobs.includes(job: %i[category user]).order(created_at: :desc).limit(5)

      applied_category_ids = current_user.job_applications.joins(:job).pluck("jobs.category_id").uniq
      @suggested_jobs = if applied_category_ids.any?
        Job.active.where(category_id: applied_category_ids)
           .where.not(id: current_user.job_applications.select(:job_id))
           .includes(:category, :user).limit(5)
      else
        Job.active.includes(:category, :user).recent.limit(5)