app/controllers/seeker/saved_controller.rb

SELECT "saved_jobs".* FROM "saved_jobs" WHERE "saved_jobs"."user_id" = ? ORDER BY "saved_jobs"."created_at" DESC  [["user_id", 886196631]]
UPDATE "categories" SET "jobs_count" = COALESCE("categories"."jobs_count", 0) + ? WHERE "categories"."id" = ?  [["jobs_count", 1], ["id", 242652078]]
---
    def index
      @saved_jobs = current_user.saved_jobs.includes(job: %i[category user]).order(created_at: :desc)