app/controllers/admin/dashboard_controller.rb

    def show
      @total_users = User.count
      @total_jobs = Job.count
      @total_applications = JobApplication.count
      @recent_jobs = Job.includes(:category, :user).order(created_at: :desc).limit(10)
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "job_applications"
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?)  [["id", 223304243], ["id", 242652078], ["id", 344023402]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 177190732], ["id", 556383200]]