app/controllers/admin/jobs_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 177190732], ["id", 556383200]]
---
    def index
      @pagy, @jobs = pagy(Job.includes(:category, :user).order(created_at: :desc), limit: 20)