app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
---
    def index
      @pagy, @users = pagy(User.order(created_at: :desc), limit: 20)