app/views/jobs/_search.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
      <label for="category" class="block text-xs font-medium text-gray-600 mb-1">Category</label>
      <%= select_tag :category, options_for_select(@categories.map { |c| [c.name, c.slug] }, params[:category]),
          prompt: "All Categories",
          class: "w-full rounded-md border-gray-300 text-sm px-3 py-2 border",
          onchange: "this.form.requestSubmit()" %>