app/views/employer/jobs/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
      <%= f.label :category_id, "Category", class: "block text-sm font-medium text-gray-700" %>
      <%= f.collection_select :category_id, Category.ordered, :id, :name, { prompt: "Select category" }, class: "mt-1 block w-full rounded-md border-gray-300 shadow-sm focus:border-indigo-500 focus:ring-indigo-500 px-3 py-2 border" %>