app/controllers/jobs_controller.rb

  def index
    @jobs = Job.active.includes(:category, :user).recent
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?)  [["id", 223304243], ["id", 242652078], ["id", 344023402]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 177190732], ["id", 556383200]]

  def show
    @job = Job.includes(:category, :user).find(params[:id])
    @already_applied = user_signed_in? && current_user.seeker? &&
                       @job.job_applications.exists?(user: current_user)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ?  [["id", 242652078]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 527713537], ["LIMIT", 1]]
SELECT 1 AS one FROM "job_applications" WHERE "job_applications"."user_id" = ? AND "job_applications"."job_id" = ? LIMIT ?  [["user_id", 886196631], ["job_id", 305584985], ["LIMIT", 1]]

  def save_job
    @job = Job.published.find(params[:id])

    unless current_user.seeker?
      redirect_to job_path(@job), alert: "Only job seekers can save jobs."
      return
    end

    current_user.saved_jobs.find_or_create_by(job: @job)
---
INSERT INTO "saved_jobs" ("created_at", "job_id", "updated_at", "user_id") VALUES (?, ?, ?, ?) RETURNING "id"  [["created_at", "2026-02-19 09:04:31.145184"], ["job_id", 305584985], ["updated_at", "2026-02-19 09:04:31.145184"], ["user_id", 527713537]]
SELECT "saved_jobs".* FROM "saved_jobs" WHERE "saved_jobs"."user_id" = ? AND "saved_jobs"."job_id" = ? LIMIT ?  [["user_id", 527713537], ["job_id", 305584985], ["LIMIT", 1]]

  def unsave_job
    @job = Job.find(params[:id])
    current_user.saved_jobs.where(job: @job).destroy_all
---
SELECT "saved_jobs".* FROM "saved_jobs" WHERE "saved_jobs"."user_id" = ? AND "saved_jobs"."job_id" = ?  [["user_id", 886196631], ["job_id", 200141451]]